Doc.org
#+TITLE: Photometric Analysis of Globular Clusters in NGC 5128 (Centaurus A)
#+AUTHOR: Luis A. Gutiérrez Soto
#+DATE: 15/09/2025
#+DESCRIPTION: Complete pipeline for photometric analysis of globular clusters in Centaurus A using SPLUS data
#+STARTUP: showall

* Introduction
** NGC 5128 (Centaurus A)
Centaurus A (also known as NGC 5128 or Caldwell 77) is a galaxy in the constellation of Centaurus.
It was discovered in 1826 by Scottish astronomer James Dunlop from his home in Parramatta,
in New South Wales, Australia. 

*** Key Properties
- Hubble type: Lenticular galaxy or giant elliptical galaxy (debated in literature)
- Distance: 11-13 million light-years (uncertain)
- Significance:
  - Closest radio galaxy to Earth
  - Closest BL Lac object
  - Fifth-brightest galaxy in the sky
- Visibility: Only visible from the southern hemisphere and low northern latitudes

** Project Objective
Perform aperture photometry of globular clusters in NGC 5128 using data from the SPLUS (Southern Photometric Local Universe Survey).

* Project Structure
** Main Directories
.
├── anac_data/                 # SPLUS data (by field)
├── Programs/             # Python scripts
├── programss/            # Python scripts to do synthetic photometry
├── Results/             # Photometry results
└── Documentation/       # Documentation (this file)

** Processed SPLUS Fields
| Field  | RA       | DEC      | Notes |
|--------+----------+----------+-------|
| CenA01 | 200.1234 | -47.2345 |       |
| ...    | ...      | ...      |       |
| CenA24 | 200.5678 | -46.7890 |       |

* Methodology
** Pipeline Summary
1. Estimate instrumetal photometry for referece stars
2. Extraction of Gaia XP spectra for reference stars
3. Generation of synthetic photometry from XP spectra
4. Zero-point calculation for each field
5. Aperture photometry of globular clusters

** Step 1: Extraction of Gaia XP Spectra
*** Objective
Identify stars in each SPLUS field and estimate the intrumentl
magnitude using the python pagcage photutils obtain their
Gaia DR3 XP spectra for calibration.

*** Script Used
#+BEGIN_SRC sh
python ../Programs/extract_splus_gaia_xp_final.py
#+END_SRC

*** Inputs
- SPLUS images for each field
- Gaia DR3 catalog (automatically queried)

*** Outputs
- CenAXX_gaia_xp_matches.csv → Catalog of matched stars
- gaia_spectra_CenAXX/ → Directory with spectra in ASCII format

*** Notes
- ~100 stars per field used as references
- Script performs cross-match between SPLUS detections and Gaia DR3
- Downloads XP spectra for matched stars

** Step 2: Synthetic Photometry
*** Objective
Calculate synthetic SPLUS magnitudes from Gaia XP spectra.

*** Execution Command
#+BEGIN_SRC sh
for D in ./gaia_spectra_CenA*; do 
    if [ -d "$D" ]; then 
        cd "$D"; 
        for f in *.dat; do 
            python ../../programs/symphotometry.py ${f%.dat} --filters SPLUS21 --name Ref --savefig --debug; 
        done; 
        cd ..; 
    fi; 
done
#+END_SRC

*** Parameters
- --filters SPLUS21 → SPLUS filters (12 bands)
- --savefig → Save diagnostic plots
- --debug → Verbose mode for debugging

*** Outputs
- Synthetic magnitudes for all SPLUS filters
- Diagnostic plots (if --savefig used)

** Step 3: Zero-point Calculation
