Doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-15 Mon 21:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Photometric Analysis of Globular Clusters in NGC 5128 (Centaurus A)</title>
<meta name="author" content="Luis A. Gutiérrez Soto" />
<meta name="description" content="Complete pipeline for photometric analysis of globular clusters in Centaurus A using SPLUS data" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Photometric Analysis of Globular Clusters in NGC 5128 (Centaurus A)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c35de8">1. Introduction</a>
<ul>
<li><a href="#org2383a4a">1.1. NGC 5128 (Centaurus A)</a>
<ul>
<li><a href="#orgd1629ca">1.1.1. Key Properties</a></li>
</ul>
</li>
<li><a href="#org4c2fefd">1.2. Project Objective</a></li>
</ul>
</li>
<li><a href="#org3243145">2. Project Structure</a>
<ul>
<li><a href="#orgefe89e3">2.1. Main Directories</a></li>
<li><a href="#org52a9204">2.2. Processed SPLUS Fields</a></li>
</ul>
</li>
<li><a href="#org99f39fd">3. Methodology</a>
<ul>
<li><a href="#orgf4f5d3e">3.1. Pipeline Summary</a></li>
<li><a href="#org069c905">3.2. Step 1: Extraction of Gaia XP Spectra</a>
<ul>
<li><a href="#org12a53a3">3.2.1. Objective</a></li>
<li><a href="#org2f4b862">3.2.2. Script Used</a></li>
<li><a href="#org2f8f527">3.2.3. Inputs</a></li>
<li><a href="#org4e439f8">3.2.4. Outputs</a></li>
<li><a href="#org4534fe4">3.2.5. Notes</a></li>
</ul>
</li>
<li><a href="#orgee79c52">3.3. Step 2: Synthetic Photometry</a>
<ul>
<li><a href="#org1d95522">3.3.1. Objective</a></li>
<li><a href="#org98e398a">3.3.2. Execution Command</a></li>
<li><a href="#org2b2e375">3.3.3. Parameters</a></li>
<li><a href="#orgdedf98c">3.3.4. Outputs</a></li>
</ul>
</li>
<li><a href="#orgf660c43">3.4. Step 3: Zero-point Calculation</a>
<ul>
<li><a href="#org05c8e11">3.4.1. Objective</a></li>
<li><a href="#org52352b2">3.4.2. Individual Processing</a></li>
<li><a href="#org75210dc">3.4.3. Expected Output</a></li>
<li><a href="#org2ddb2d9">3.4.4. Batch Processing (All Fields)</a></li>
<li><a href="#org883ddbd">3.4.5. Output Files</a></li>
<li><a href="#org621674f">3.4.6. Statistical Summary</a></li>
</ul>
</li>
<li><a href="#org186a1e2">3.5. Step 4: Globular Cluster Photometry</a>
<ul>
<li><a href="#orgb733fa3">3.5.1. Objective</a></li>
<li><a href="#org7965162">3.5.2. Main Script</a></li>
<li><a href="#orga9ca3f5">3.5.3. Main Inputs</a></li>
<li><a href="#org7617518">3.5.4. Photometry Parameters</a></li>
<li><a href="#org8afeb9f">3.5.5. Outputs</a></li>
<li><a href="#org1c993ab">3.5.6. Final Catalog Structure</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9888558">4. Execution Instructions</a>
<ul>
<li><a href="#org54095ed">4.1. Initial Setup</a></li>
<li><a href="#org237ce04">4.2. Execution Order</a></li>
<li><a href="#org1813b58">4.3. Complete Reprocessing Command</a></li>
</ul>
</li>
<li><a href="#org15d2d37">5. Troubleshooting</a>
<ul>
<li><a href="#orgc7b8bde">5.1. Common Issues</a>
<ul>
<li><a href="#org6e88380">5.1.1. SPLUS Images Not Found</a></li>
<li><a href="#org24f4434">5.1.2. No Zero-points for a Field</a></li>
<li><a href="#orgb2717c5">5.1.3. Sources Near Edge</a></li>
</ul>
</li>
<li><a href="#orga67bc1d">5.2. Result Interpretation</a></li>
</ul>
</li>
<li><a href="#org266151e">6. Results and Products</a>
<ul>
<li><a href="#orge11ef5f">6.1. Generated Catalogs</a></li>
<li><a href="#org06600f9">6.2. Output Formats</a></li>
<li><a href="#org9bdf5eb">6.3. Quality Analysis</a></li>
</ul>
</li>
<li><a href="#orgde6abdd">7. Technical Notes</a>
<ul>
<li><a href="#org18b4029">7.1. System Requirements</a></li>
<li><a href="#org994c76e">7.2. Python Dependencies</a></li>
<li><a href="#orgd4c22fe">7.3. Estimated Execution Time</a></li>
</ul>
</li>
<li><a href="#org5690c85">8. Contact and References</a></li>
<li><a href="#org124eb59">9. Documentation last updated: 15/09/2025 *</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2c35de8" class="outline-2">
<h2 id="org2c35de8"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2383a4a" class="outline-3">
<h3 id="org2383a4a"><span class="section-number-3">1.1.</span> NGC 5128 (Centaurus A)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Centaurus A (also known as NGC 5128 or Caldwell 77) is a galaxy in the constellation of Centaurus.
It was discovered in 1826 by Scottish astronomer James Dunlop from his home in Parramatta,
in New South Wales, Australia. 
</p>
</div>

<div id="outline-container-orgd1629ca" class="outline-4">
<h4 id="orgd1629ca"><span class="section-number-4">1.1.1.</span> Key Properties</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Hubble type: Lenticular galaxy or giant elliptical galaxy (debated in literature)</li>
<li>Distance: 11-13 million light-years (uncertain)</li>
<li>Significance:
<ul class="org-ul">
<li>Closest radio galaxy to Earth</li>
<li>Closest BL Lac object</li>
<li>Fifth-brightest galaxy in the sky</li>
</ul></li>
<li>Visibility: Only visible from the southern hemisphere and low northern latitudes</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4c2fefd" class="outline-3">
<h3 id="org4c2fefd"><span class="section-number-3">1.2.</span> Project Objective</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Perform aperture photometry of globular clusters in NGC 5128 using data from the SPLUS (Southern Photometric Local Universe Survey).
</p>
</div>
</div>
</div>

<div id="outline-container-org3243145" class="outline-2">
<h2 id="org3243145"><span class="section-number-2">2.</span> Project Structure</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgefe89e3" class="outline-3">
<h3 id="orgefe89e3"><span class="section-number-3">2.1.</span> Main Directories</h3>
<div class="outline-text-3" id="text-2-1">
<p>
.
├── anac<sub>data</sub>/                 # SPLUS data (by field)
├── Programs/             # Python scripts
├── Catalogs/            # Input and output catalogs
├── Results/             # Photometry results
└── Documentation/       # Documentation (this file)
</p>
</div>
</div>

<div id="outline-container-org52a9204" class="outline-3">
<h3 id="org52a9204"><span class="section-number-3">2.2.</span> Processed SPLUS Fields</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-right">RA</th>
<th scope="col" class="org-right">DEC</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CenA01</td>
<td class="org-right">200.1234</td>
<td class="org-right">-47.2345</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-right">&#x2026;</td>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CenA24</td>
<td class="org-right">200.5678</td>
<td class="org-right">-46.7890</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org99f39fd" class="outline-2">
<h2 id="org99f39fd"><span class="section-number-2">3.</span> Methodology</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf4f5d3e" class="outline-3">
<h3 id="orgf4f5d3e"><span class="section-number-3">3.1.</span> Pipeline Summary</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Estimate instrumetal photometry for refereces stars</li>
<li>Extraction of Gaia XP spectra for reference stars</li>
<li>Generation of synthetic photometry from XP spectra</li>
<li>Zero-point calculation for each field</li>
<li>Aperture photometry of globular clusters</li>
</ol>
</div>
</div>

<div id="outline-container-org069c905" class="outline-3">
<h3 id="org069c905"><span class="section-number-3">3.2.</span> Step 1: Extraction of Gaia XP Spectra</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org12a53a3" class="outline-4">
<h4 id="org12a53a3"><span class="section-number-4">3.2.1.</span> Objective</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Identify stars in each SPLUS field and estimate the intrumentl
magnitude using the python pagcage photutils obtain their
Gaia DR3 XP spectra for calibration.
</p>
</div>
</div>

<div id="outline-container-org2f4b862" class="outline-4">
<h4 id="org2f4b862"><span class="section-number-4">3.2.2.</span> Script Used</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-sh">python ../Programs/extract_splus_gaia_xp_final.py
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f8f527" class="outline-4">
<h4 id="org2f8f527"><span class="section-number-4">3.2.3.</span> Inputs</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>SPLUS images for each field</li>
<li>Gaia DR3 catalog (automatically queried)</li>
</ul>
</div>
</div>

<div id="outline-container-org4e439f8" class="outline-4">
<h4 id="org4e439f8"><span class="section-number-4">3.2.4.</span> Outputs</h4>
<div class="outline-text-4" id="text-3-2-4">
<ul class="org-ul">
<li>CenAXX<sub>gaia</sub><sub>xp</sub><sub>matches.csv</sub> → Catalog of matched stars</li>
<li>gaia<sub>spectra</sub><sub>CenAXX</sub>/ → Directory with spectra in ASCII format</li>
</ul>
</div>
</div>

<div id="outline-container-org4534fe4" class="outline-4">
<h4 id="org4534fe4"><span class="section-number-4">3.2.5.</span> Notes</h4>
<div class="outline-text-4" id="text-3-2-5">
<ul class="org-ul">
<li>~100 stars per field used as references</li>
<li>Script performs cross-match between SPLUS detections and Gaia DR3</li>
<li>Downloads XP spectra for matched stars</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgee79c52" class="outline-3">
<h3 id="orgee79c52"><span class="section-number-3">3.3.</span> Step 2: Synthetic Photometry</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org1d95522" class="outline-4">
<h4 id="org1d95522"><span class="section-number-4">3.3.1.</span> Objective</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Calculate synthetic SPLUS magnitudes from Gaia XP spectra.
</p>
</div>
</div>

<div id="outline-container-org98e398a" class="outline-4">
<h4 id="org98e398a"><span class="section-number-4">3.3.2.</span> Execution Command</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #00ffff;">for</span> D<span style="color: #00ffff;"> in</span> ./gaia_spectra_CenA*; <span style="color: #00ffff;">do</span> 
    <span style="color: #00ffff;">if</span> [ -d <span style="color: #ffa07a;">"$D"</span> ]; <span style="color: #00ffff;">then</span> 
        <span style="color: #b0c4de;">cd</span> <span style="color: #ffa07a;">"$D"</span>; 
        <span style="color: #00ffff;">for</span> f<span style="color: #00ffff;"> in</span> *.dat; <span style="color: #00ffff;">do</span> 
            python ../../programs/symphotometry.py ${<span style="color: #eedd82;">f</span>%.dat} --filters SPLUS21 --name Ref --savefig --debug; 
        <span style="color: #00ffff;">done</span>; 
        <span style="color: #b0c4de;">cd</span> ..; 
    <span style="color: #00ffff;">fi</span>; 
<span style="color: #00ffff;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2b2e375" class="outline-4">
<h4 id="org2b2e375"><span class="section-number-4">3.3.3.</span> Parameters</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li>&#x2013;filters SPLUS21 → SPLUS filters (12 bands)</li>
<li>&#x2013;savefig → Save diagnostic plots</li>
<li>&#x2013;debug → Verbose mode for debugging</li>
</ul>
</div>
</div>

<div id="outline-container-orgdedf98c" class="outline-4">
<h4 id="orgdedf98c"><span class="section-number-4">3.3.4.</span> Outputs</h4>
<div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li>Synthetic magnitudes for all SPLUS filters</li>
<li>Diagnostic plots (if &#x2013;savefig used)</li>
</ul>
</div>
</div>
</div>
