Doc.org
*** Objective
Calculate photometric zero-points by comparing instrumental and synthetic magnitudes.

*** Individual Processing
#+BEGIN_SRC sh
python ../Programs/calculate_zero_points.py CenA01_gaia_xp_matches.csv --json-dir . --plot
#+END_SRC

*** Expected Output
#+BEGIN_EXAMPLE
Processing field CenA01 with 396 stars
mag_F378: 100 stars, Median ZP = 19.649 ± 0.049 (MAD)
mag_F395: 100 stars, Median ZP = 19.683 ± 0.056 (MAD)
...
Results saved to CenA01_zero_points.csv
Plot saved as CenA01_zero_points.png
#+END_EXAMPLE

*** Batch Processing (All Fields)
#+BEGIN_SRC sh
python ../Programs/ZeroPoints_calculations.py
#+END_SRC

*** Output Files
- all_fields_zero_points_detailed.csv → Detailed results
- average_zero_points_detailed.csv → Average zero-points with uncertainties
- all_fields_zero_points_splus_format.csv → Zero-points in SPLUS format
- average_zero_points_splus_format.csv → Average zero-points in SPLUS format

*** Statistical Summary
#+BEGIN_EXAMPLE
=== SPLUS FORMAT SUMMARY ===
Processed 24 fields
F378: 19.534433 ± 0.124996
F395: 19.626046 ± 0.121728
...
#+END_EXAMPLE

** Step 4: Globular Cluster Photometry
*** Objective
Perform aperture photometry of globular clusters using the calculated zero-points.

*** Main Script
#+BEGIN_SRC sh
python Splus_photometry_final.py
#+END_SRC

*** Main Inputs
- TAP_1_J_MNRAS_3444_gc.csv → Globular cluster catalog
- all_fields_zero_points_splus_format.csv → Zero-points for all fields
- SPLUS images for each field and filter

*** Photometry Parameters
- Apertures: 3, 4, 5, 6 arcsec (diameter)
- Background annulus: 6-9 arcsec
- Minimum SNR: 3

*** Outputs
- CenAXX_gc_photometry.csv → Individual field results
- all_fields_gc_photometry_merged.csv → Final combined catalog

*** Final Catalog Structure
| Column         | Description                                 | Special Values        |
|-----------------+---------------------------------------------+---------------------------|
| [Original columns] | From TAP_1_J_MNRAS_3444_gc catalog          |                           |
| FLUX_FXXX_Y      | Flux in filter FXXX with aperture Y arcsec  | 0.0 = Not measured        |
| FLUXERR_FXXX_Y   | Flux error                                  | 99.0 = Measurement error  |
| MAG_FXXX_Y       | Magnitude                                   | 99.0 = Source not detectable |
| MAGERR_FXXX_Y    | Magnitude error                             | 99.0 = Measurement error  |
| SNR_FXXX_Y       | Signal-to-noise ratio                       | 0.0 = Not measured        |
| FIELD            | SPLUS field where source was measured       | NaN = Source not in field |

* Execution Instructions
** Initial Setup
1. Ensure correct directory structure
2. Verify all SPLUS fields are available
3. Confirm location of globular cluster catalog

** Execution Order
1. Extract Gaia XP spectra → Step 1
2. Generate synthetic photometry → Step 2
3. Calculate zero-points → Step 3
4. Run cluster photometry → Step 4

** Complete Reprocessing Command
#+BEGIN_SRC sh
# Step 1: Extract XP spectra
python ../Programs/extract_splus_gaia_xp_final.py

# Step 2: Synthetic photometry (run in spectra directory)
for D in ./gaia_spectra_CenA*; do 
    if [ -d "$D" ]; then 
        cd "$D"; 
        for f in *.dat; do 
            python ../../programs/symphotometry.py ${f%.dat} --filters SPLUS21 --name Ref --savefig; 
        done; 
        cd ..; 
    fi; 
done

# Step 3: Zero-point calculation
python ../Programs/ZeroPoints_calculations.py

# Step 4: Cluster photometry
python Splus_photometry_final.py
#+END_SRC

* Troubleshooting
** Common Issues
*** SPLUS Images Not Found
- Verify directory structure
- Ensure images follow correct naming convention

*** No Zero-points for a Field
- Verify field is in all_fields_zero_points_splus_format.csv
- Check zero-point calculation for that specific field

*** Sources Near Edge
- Script automatically flags with 99.0 for edge sources
- Consider using smaller aperture for these sources

** Result Interpretation
- Magnitude values of 99.0: Source detected but not properly measured
- NaN values: Source not in field
- SNR < 3: Measurements considered unreliable

* Results and Products
