Doc.html

<div id="outline-container-orgf660c43" class="outline-3">
<h3 id="orgf660c43"><span class="section-number-3">3.4.</span> Step 3: Zero-point Calculation</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org05c8e11" class="outline-4">
<h4 id="org05c8e11"><span class="section-number-4">3.4.1.</span> Objective</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Calculate photometric zero-points by comparing instrumental and synthetic magnitudes.
</p>
</div>
</div>

<div id="outline-container-org52352b2" class="outline-4">
<h4 id="org52352b2"><span class="section-number-4">3.4.2.</span> Individual Processing</h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">
<pre class="src src-sh">python ../Programs/calculate_zero_points.py CenA01_gaia_xp_matches.csv --json-dir . --plot
</pre>
</div>
</div>
</div>

<div id="outline-container-org75210dc" class="outline-4">
<h4 id="org75210dc"><span class="section-number-4">3.4.3.</span> Expected Output</h4>
<div class="outline-text-4" id="text-3-4-3">
<pre class="example" id="org47c8eb2">
Processing field CenA01 with 396 stars
mag_F378: 100 stars, Median ZP = 19.649 ± 0.049 (MAD)
mag_F395: 100 stars, Median ZP = 19.683 ± 0.056 (MAD)
...
Results saved to CenA01_zero_points.csv
Plot saved as CenA01_zero_points.png
</pre>
</div>
</div>

<div id="outline-container-org2ddb2d9" class="outline-4">
<h4 id="org2ddb2d9"><span class="section-number-4">3.4.4.</span> Batch Processing (All Fields)</h4>
<div class="outline-text-4" id="text-3-4-4">
<div class="org-src-container">
<pre class="src src-sh">python ../Programs/ZeroPoints_calculations.py
</pre>
</div>
</div>
</div>

<div id="outline-container-org883ddbd" class="outline-4">
<h4 id="org883ddbd"><span class="section-number-4">3.4.5.</span> Output Files</h4>
<div class="outline-text-4" id="text-3-4-5">
<ul class="org-ul">
<li>all<sub>fields</sub><sub>zero</sub><sub>points</sub><sub>detailed.csv</sub> → Detailed results</li>
<li>average<sub>zero</sub><sub>points</sub><sub>detailed.csv</sub> → Average zero-points with uncertainties</li>
<li>all<sub>fields</sub><sub>zero</sub><sub>points</sub><sub>splus</sub><sub>format.csv</sub> → Zero-points in SPLUS format</li>
<li>average<sub>zero</sub><sub>points</sub><sub>splus</sub><sub>format.csv</sub> → Average zero-points in SPLUS format</li>
</ul>
</div>
</div>

<div id="outline-container-org621674f" class="outline-4">
<h4 id="org621674f"><span class="section-number-4">3.4.6.</span> Statistical Summary</h4>
<div class="outline-text-4" id="text-3-4-6">
<pre class="example" id="org5136667">
=== SPLUS FORMAT SUMMARY ===
Processed 24 fields
F378: 19.534433 ± 0.124996
F395: 19.626046 ± 0.121728
...
</pre>
</div>
</div>
</div>

<div id="outline-container-org186a1e2" class="outline-3">
<h3 id="org186a1e2"><span class="section-number-3">3.5.</span> Step 4: Globular Cluster Photometry</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-orgb733fa3" class="outline-4">
<h4 id="orgb733fa3"><span class="section-number-4">3.5.1.</span> Objective</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Perform aperture photometry of globular clusters using the calculated zero-points.
</p>
</div>
</div>

<div id="outline-container-org7965162" class="outline-4">
<h4 id="org7965162"><span class="section-number-4">3.5.2.</span> Main Script</h4>
<div class="outline-text-4" id="text-3-5-2">
<div class="org-src-container">
<pre class="src src-sh">python Splus_photometry_final.py
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9ca3f5" class="outline-4">
<h4 id="orga9ca3f5"><span class="section-number-4">3.5.3.</span> Main Inputs</h4>
<div class="outline-text-4" id="text-3-5-3">
<ul class="org-ul">
<li>TAP<sub>1</sub><sub>J</sub><sub>MNRAS</sub><sub>3444</sub><sub>gc.csv</sub> → Globular cluster catalog</li>
<li>all<sub>fields</sub><sub>zero</sub><sub>points</sub><sub>splus</sub><sub>format.csv</sub> → Zero-points for all fields</li>
<li>SPLUS images for each field and filter</li>
</ul>
</div>
</div>

<div id="outline-container-org7617518" class="outline-4">
<h4 id="org7617518"><span class="section-number-4">3.5.4.</span> Photometry Parameters</h4>
<div class="outline-text-4" id="text-3-5-4">
<ul class="org-ul">
<li>Apertures: 3, 4, 5, 6 arcsec (diameter)</li>
<li>Background annulus: 6-9 arcsec</li>
<li>Minimum SNR: 3</li>
</ul>
</div>
</div>

<div id="outline-container-org8afeb9f" class="outline-4">
<h4 id="org8afeb9f"><span class="section-number-4">3.5.5.</span> Outputs</h4>
<div class="outline-text-4" id="text-3-5-5">
<ul class="org-ul">
<li>CenAXX<sub>gc</sub><sub>photometry.csv</sub> → Individual field results</li>
<li>all<sub>fields</sub><sub>gc</sub><sub>photometry</sub><sub>merged.csv</sub> → Final combined catalog</li>
</ul>
</div>
</div>

<div id="outline-container-org1c993ab" class="outline-4">
<h4 id="org1c993ab"><span class="section-number-4">3.5.6.</span> Final Catalog Structure</h4>
<div class="outline-text-4" id="text-3-5-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Column</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Special Values</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">[Original columns]</td>
<td class="org-left">From TAP<sub>1</sub><sub>J</sub><sub>MNRAS</sub><sub>3444</sub><sub>gc</sub> catalog</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">FLUX<sub>FXXX</sub><sub>Y</sub></td>
<td class="org-left">Flux in filter FXXX with aperture Y arcsec</td>
<td class="org-left">0.0 = Not measured</td>
</tr>

<tr>
<td class="org-left">FLUXERR<sub>FXXX</sub><sub>Y</sub></td>
<td class="org-left">Flux error</td>
<td class="org-left">99.0 = Measurement error</td>
</tr>

<tr>
<td class="org-left">MAG<sub>FXXX</sub><sub>Y</sub></td>
<td class="org-left">Magnitude</td>
<td class="org-left">99.0 = Source not detectable</td>
</tr>

<tr>
<td class="org-left">MAGERR<sub>FXXX</sub><sub>Y</sub></td>
<td class="org-left">Magnitude error</td>
<td class="org-left">99.0 = Measurement error</td>
</tr>

<tr>
<td class="org-left">SNR<sub>FXXX</sub><sub>Y</sub></td>
<td class="org-left">Signal-to-noise ratio</td>
<td class="org-left">0.0 = Not measured</td>
</tr>

<tr>
<td class="org-left">FIELD</td>
<td class="org-left">SPLUS field where source was measured</td>
<td class="org-left">NaN = Source not in field</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>

<div id="outline-container-org9888558" class="outline-2">
<h2 id="org9888558"><span class="section-number-2">4.</span> Execution Instructions</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org54095ed" class="outline-3">
<h3 id="org54095ed"><span class="section-number-3">4.1.</span> Initial Setup</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>Ensure correct directory structure</li>
<li>Verify all SPLUS fields are available</li>
<li>Confirm location of globular cluster catalog</li>
</ol>
</div>
</div>

<div id="outline-container-org237ce04" class="outline-3">
<h3 id="org237ce04"><span class="section-number-3">4.2.</span> Execution Order</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Extract Gaia XP spectra → Step 1</li>
<li>Generate synthetic photometry → Step 2</li>
<li>Calculate zero-points → Step 3</li>
<li>Run cluster photometry → Step 4</li>
</ol>
</div>
</div>

<div id="outline-container-org1813b58" class="outline-3">
<h3 id="org1813b58"><span class="section-number-3">4.3.</span> Complete Reprocessing Command</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Step 1: Extract XP spectra</span>
python ../Programs/extract_splus_gaia_xp_final.py

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Step 2: Synthetic photometry (run in spectra directory)</span>
<span style="color: #00ffff;">for</span> D<span style="color: #00ffff;"> in</span> ./gaia_spectra_CenA*; <span style="color: #00ffff;">do</span> 
    <span style="color: #00ffff;">if</span> [ -d <span style="color: #ffa07a;">"$D"</span> ]; <span style="color: #00ffff;">then</span> 
        <span style="color: #b0c4de;">cd</span> <span style="color: #ffa07a;">"$D"</span>; 
        <span style="color: #00ffff;">for</span> f<span style="color: #00ffff;"> in</span> *.dat; <span style="color: #00ffff;">do</span> 
            python ../../programs/symphotometry.py ${<span style="color: #eedd82;">f</span>%.dat} --filters SPLUS21 --name Ref --savefig; 
        <span style="color: #00ffff;">done</span>; 
        <span style="color: #b0c4de;">cd</span> ..; 
    <span style="color: #00ffff;">fi</span>; 
<span style="color: #00ffff;">done</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Step 3: Zero-point calculation</span>
python ../Programs/ZeroPoints_calculations.py

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Step 4: Cluster photometry</span>
python Splus_photometry_final.py
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15d2d37" class="outline-2">
<h2 id="org15d2d37"><span class="section-number-2">5.</span> Troubleshooting</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc7b8bde" class="outline-3">
<h3 id="orgc7b8bde"><span class="section-number-3">5.1.</span> Common Issues</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org6e88380" class="outline-4">
<h4 id="org6e88380"><span class="section-number-4">5.1.1.</span> SPLUS Images Not Found</h4>
<div class="outline-text-4" id="text-5-1-1">
<ul class="org-ul">
<li>Verify directory structure</li>
<li>Ensure images follow correct naming convention</li>
</ul>
</div>
</div>

<div id="outline-container-org24f4434" class="outline-4">
<h4 id="org24f4434"><span class="section-number-4">5.1.2.</span> No Zero-points for a Field</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>Verify field is in all<sub>fields</sub><sub>zero</sub><sub>points</sub><sub>splus</sub><sub>format.csv</sub></li>
<li>Check zero-point calculation for that specific field</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2717c5" class="outline-4">
<h4 id="orgb2717c5"><span class="section-number-4">5.1.3.</span> Sources Near Edge</h4>
<div class="outline-text-4" id="text-5-1-3">
<ul class="org-ul">
<li>Script automatically flags with 99.0 for edge sources</li>
<li>Consider using smaller aperture for these sources</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga67bc1d" class="outline-3">
<h3 id="orga67bc1d"><span class="section-number-3">5.2.</span> Result Interpretation</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Magnitude values of 99.0: Source detected but not properly measured</li>
<li>NaN values: Source not in field</li>
<li>SNR &lt; 3: Measurements considered unreliable</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org266151e" class="outline-2">
<h2 id="org266151e"><span class="section-number-2">6.</span> Results and Products</h2>
<div class="outline-text-2" id="text-6">
</div>
