Doc.html
<div id="outline-container-orge11ef5f" class="outline-3">
<h3 id="orge11ef5f"><span class="section-number-3">6.1.</span> Generated Catalogs</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>all<sub>fields</sub><sub>gc</sub><sub>photometry</sub><sub>merged.csv</sub> → Main catalog with all measurements</li>
<li>CenAXX<sub>gc</sub><sub>photometry.csv</sub> → Individual field results</li>
</ul>
</div>
</div>

<div id="outline-container-org06600f9" class="outline-3">
<h3 id="org06600f9"><span class="section-number-3">6.2.</span> Output Formats</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>CSV with columns organized by filter and aperture</li>
<li>Special values: 99.0 for failed measurements, NaN for out-of-field sources</li>
</ul>
</div>
</div>

<div id="outline-container-org9bdf5eb" class="outline-3">
<h3 id="org9bdf5eb"><span class="section-number-3">6.3.</span> Quality Analysis</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Script includes statistical summary of data quality</li>
<li>Reports number of valid measurements per filter and aperture</li>
<li>Provides average SNR and average magnitude per filter</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgde6abdd" class="outline-2">
<h2 id="orgde6abdd"><span class="section-number-2">7.</span> Technical Notes</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org18b4029" class="outline-3">
<h3 id="org18b4029"><span class="section-number-3">7.1.</span> System Requirements</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Python 3.7+</li>
<li>Memory: ≥8GB RAM recommended for processing all fields</li>
<li>Storage: ~50GB for SPLUS images + results</li>
</ul>
</div>
</div>

<div id="outline-container-org994c76e" class="outline-3">
<h3 id="org994c76e"><span class="section-number-3">7.2.</span> Python Dependencies</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>astropy, numpy, pandas, photutils, tqdm, matplotlib</li>
</ul>
</div>
</div>

<div id="outline-container-orgd4c22fe" class="outline-3">
<h3 id="orgd4c22fe"><span class="section-number-3">7.3.</span> Estimated Execution Time</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Complete run: 6-12 hours (hardware dependent)</li>
<li>Per field: 15-30 minutes</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5690c85" class="outline-2">
<h2 id="org5690c85"><span class="section-number-2">8.</span> Contact and References</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Author: Luis A. Gutiérrez Soto</li>
<li>Email: gsoto.angel@gmail.com</li>
<li>Catalog reference: TAP<sub>1</sub><sub>J</sub><sub>MNRAS</sub><sub>3444</sub><sub>gc.csv</sub> (Taylor et al. 2017, MNRAS, 3444)</li>
<li>SPLUS Survey: Mendes de Oliveira et al. (2019)</li>
</ul>

<p>
#+BEGIN<sub>CENTER</sub>
</p>
</div>
</div>
<div id="outline-container-org124eb59" class="outline-2">
<h2 id="org124eb59"><span class="section-number-2">9.</span> Documentation last updated: 15/09/2025 *</h2>
<div class="outline-text-2" id="text-9">
<p>
#+END<sub>CENTER</sub>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 15/09/2025</p>
<p class="author">Author: Luis A. Gutiérrez Soto</p>
<p class="date">Created: 2025-09-15 Mon 21:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
